app/views/posts/show.html.erb


    <%if @post.recent_comments.count > 0%>
      <ul class='comments'>
        <% @post.recent_comments.each do |comment| %>
          <%commentor = @users.find(comment.user_id)%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]