app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def new
    @comment = Comment.new
    @post = Post.find(params[:post_id])

INSERT INTO "comments" ("text", "created_at", "updated_at", "user_id", "post_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "Yes"], ["created_at", "2023-10-21 14:53:14.520648"], ["updated_at", "2023-10-21 14:53:14.520648"], ["user_id", 1], ["post_id", 3]]
---
  def create
    @user = current_user
    @comment = @user.comments.build(comment_params)
    @comment.post_id = params[:post_id]

    if @comment.save