app/controllers/likes_controller.rb

    def create
      @user = User.find(params[:user_id])
      @post = @user.posts.find(params[:post_id])
      @like = @post.likes.build
      @like.user = current_user

      if @like.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "likes" ("created_at", "updated_at", "user_id", "post_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2023-10-21 15:11:39.926953"], ["updated_at", "2023-10-21 15:11:39.926953"], ["user_id", 1], ["post_id", 1]]