app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "text", "created_at", "updated_at", "author_id", "likes_count", "comments_count") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "Title"], ["text", "comment"], ["created_at", "2023-10-21 14:21:36.229630"], ["updated_at", "2023-10-21 14:21:36.229630"], ["author_id", 1], ["likes_count", 0], ["comments_count", 0]]
---
  def create
    @post = Post.new(post_params)
    @post.user = current_user
    if @post.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = $1 LIMIT $2 OFFSET $3  [["author_id", 817], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."author_id" = $1  [["author_id", 1]]
---
  def index
    @user = User.find(params[:user_id])
    @posts = Post.where(author_id: @user.id).includes(:comments, :user).paginate(page: params[:page], per_page: 10)

UPDATE "users" SET "posts_count" = COALESCE("posts_count", 0) + $1 WHERE "users"."id" = $2  [["posts_count", 1], ["id", 1]]
---
  def destroy
    @post = Post.find(params[:id])

    authorize! :destroy, @post
    @author = @post.user
    @author.decrement!(:posts_count)